testCases/T233_50_CLEEUNI_CUT/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  "T.*"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-9;
    relTol          0.01;
    maxIter	    100;
  };

  "alpha.kondensate.*"
  {
    cAlpha          1;
    nAlphaCorr      1;
    nAlphaSubCycles 1;

    MULESCorr       yes;
    nLimiterIter    10;

    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-9;
    relTol          0.01;
    //maxIter         500;
  };

  "U.*"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-9;
    relTol          0.01;
  };

  pcorr
  {
    $p_rgh;
    tolerance       1e-6;
    relTol          0.01;
  };

  "p_rgh.*"
  {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;

            tolerance       1e-10;
            relTol          0;

            nVcycles        2;

            smoother        DICGaussSeidel;
            nPreSweeps      0;
            nPostSweeps     1;
            nFinestSweeps   1;

            cacheAgglomeration true;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        };
    tolerance       1e-9;
    relTol          0.01;
        maxIter         150;
  };

    "k.*"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
    tolerance       1e-9;
    relTol          0.01;
        //nSweeps         10;
    };

    "omega.*"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
    tolerance       1e-9;
    relTol          0.01;
        //nSweeps         10;
    };
}

PIMPLE
{
    nFlowIter    1;
    dV		0;
    QResidual		5e-6;
    QIterationFlag     0;
    Qrelax                              0.8;
    Qcycles                             150;
    SourceType                          2; // 0 - KleinerSource, 1 - CLee, 2 - CLee_UNI
    SourceConstant                      10e5;
    Prt		0.85;
    
    
    momentumPredictor           yes;
    nOuterCorrectors            1;
    nCorrectors                 2;
    nNonOrthogonalCorrectors    1;
    pRefCell                    0;
    pRefValue                   1e5;
    
    turbOnFinalIterOnly no;
}

relaxationFactors
{
    equations
    {
        U               0.3;
  	p_rgh           0.7;  
        k               0.9;
        omega           0.9;
    }
}

// ************************************************************************* //
