testCases/T233_50_CLEEUNI_CUT/system/residuals
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the average value of one or more fields on a patch.

\*---------------------------------------------------------------------------*/
residuals
{
#includeEtc "caseDicts/postProcessing/numerical/residuals.cfg"

fields ( T alpha.kondensate p_rgh U );
region	fluid;
}
// ************************************************************************* //
