testCases/T233_50_CLEEUNI_CUT/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



defaultFieldValues
(
    volScalarFieldValue alpha.kondensate 0
);

regions
(
    cylinderToCell
    {
    	p1 (0.04 0.08 0.0);
    	p2 (0.04 0.08 0.5);
    	radius .00805816179780991349;
        fieldValues
        (
            volScalarFieldValue alpha.kondensate 1
        );
    }
);

// ************************************************************************* // 
